In [2]:
import pandas as pd

In [3]:
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [ ]:
teacher.groupby('teacher_id', as_index=False).agg(cnt = ('subject_id', 'nunique'))

   teacher_id  cnt
0           1    2
1           2    4

In [9]:
import pathlib
import pandas as pd
import numpy as np

In [12]:
csv_path = pathlib.Path(r"C:\Users\user\Desktop\div\data\1.04. Real-life example.csv")
df = pd.read_csv(csv_path)
df.head(3)

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500

In [20]:
df2 = df.set_index(['Brand', 'Model']).sort_index()
df2.columns = [
    ['Sayi', 'Kat', 'Sayi',   'Sayi',   'Kat',        'Kat',		 'Sayi'],
    ['Price','Body','Mileage','EngineV','Engine Type','Registration','Year']
]
df2 = df2.sort_index(axis='columns')
df2.head()

               Kat                             Sayi
              Body Engine Type Registration EngineV Mileage   Price  Year
Brand Model
Audi  100    sedan         Gas          yes     2.3       1  2900.0  1989
      100    sedan      Diesel          yes     2.0     265  3500.0  1986
      100    sedan      Petrol          yes     2.0     400  4000.0  1992
      100    sedan      Petrol          yes     2.6     390  4800.0  1993
      100    sedan         Gas          yes     2.3     280  5000.0  1992

In [21]:
m = df2.loc[:, ('Kat', 'Body')] != 'sedan'
df2.loc[m, :]

                     Kat                             Sayi                   \
                    Body Engine Type Registration EngineV Mileage    Price
Brand      Model
Audi       100     other         Gas          yes     2.2     360   3500.0
           100     hatch         Gas          yes     2.0     243      NaN
           80      vagon      Diesel           no     1.9     400   1350.0
           80      other      Petrol          yes     2.6     126   7000.0
           A1      hatch      Petrol          yes     1.4      69  16999.0
...                  ...         ...          ...     ...     ...      ...
Volkswagen Touran  vagon      Diesel           no     2.0     220   4500.0
           Touran  vagon         Gas          yes     1.4     123  13900.0
           Touran    van      Diesel          yes     1.6     170  14900.0
           Up      hatch      Petrol          yes     1.0      41   8000.0
           Up      hatch      Petrol          yes     1.0      11  12650.0


                   Year
Brand      Model
Audi       100     1990
           100     1987
           80      1994
           80      1998
           A1      2012
...                 ...
Volkswagen Touran  2005
           Touran  2013
           Touran  2012
           Up      2012
           Up      2014

[2696 rows x 7 columns]

In [23]:
df3 = df2.droplevel(axis='columns', level=0)
df3.rename({'EngineV' : 'Engine Volume'}, axis='columns', inplace=True)
df3.drop('Registration', axis='columns', inplace=True)
df3

                   Body Engine Type  Engine Volume  Mileage   Price  Year
Brand      Model
Audi       100    sedan         Gas            2.3        1  2900.0  1989
           100    sedan      Diesel            2.0      265  3500.0  1986
           100    sedan      Petrol            2.0      400  4000.0  1992
           100    sedan      Petrol            2.6      390  4800.0  1993
           100    sedan         Gas            2.3      280  5000.0  1992
...                 ...         ...            ...      ...     ...   ...
Volkswagen Vento  sedan         Gas            1.8       88  4100.0  1993
           Vento  sedan      Petrol            1.8      262  3750.0  1994
           Vento  sedan      Petrol            1.8      161  1550.0  1994
           Vento  sedan         Gas            1.8      290  4400.0  1997
           Vento  sedan      Petrol            1.8      300  3650.0  1996

[4345 rows x 6 columns]

In [28]:
df_world = pd.read_csv(r"C:\Users\user\Desktop\div\data\world_population.csv")
df_world.set_index('CCA3', inplace=True)
df_world.head(3)

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [31]:
df_world['Country']
df_world.loc[:, 'Country']
df_world.iloc[:, 1]

CCA3
AFG          Afghanistan
ALB              Albania
DZA              Algeria
ASM       American Samoa
AND              Andorra
             ...
WLF    Wallis and Futuna
ESH       Western Sahara
YEM                Yemen
ZMB               Zambia
ZWE             Zimbabwe
Name: Country, Length: 234, dtype: object

In [34]:
df_world.head()

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56
ASM,213,American Samoa,Pago Pago,Oceania,44273.0,46189.0,51368.0,54849.0,58230.0,47818.0,32886.0,27075.0,199.0,222.4774,0.9831,0.00
AND,203,Andorra,Andorra la Vella,Europe,79824.0,77700.0,71746.0,71519.0,66097.0,53569.0,35611.0,19860.0,468.0,170.5641,1.0100,0.00

In [35]:
df_world[['Country', '2022 Population']]
df_world.loc[:, ['Country', '2022 Population']]
df_world.iloc[:, [1, 4]]

                Country  2022 Population
CCA3
AFG         Afghanistan       41128771.0
ALB             Albania        2842321.0
DZA             Algeria       44903225.0
ASM      American Samoa          44273.0
AND             Andorra          79824.0
...                 ...              ...
WLF   Wallis and Futuna          11572.0
ESH      Western Sahara         575986.0
YEM               Yemen       33696614.0
ZMB              Zambia       20017675.0
ZWE            Zimbabwe       16320537.0

[234 rows x 2 columns]

In [ ]:
df_world.loc[:, 'Country':'2022 Population'] # daxil
df_world.iloc[:, 1:4] # 4 daxil olmayacaq

                Country           Capital Continent
CCA3
AFG         Afghanistan             Kabul      Asia
ALB             Albania            Tirana    Europe
DZA             Algeria           Algiers    Africa
ASM      American Samoa         Pago Pago   Oceania
AND             Andorra  Andorra la Vella    Europe
...                 ...               ...       ...
WLF   Wallis and Futuna          Mata-Utu   Oceania
ESH      Western Sahara          El Aaiún    Africa
YEM               Yemen             Sanaa      Asia
ZMB              Zambia            Lusaka    Africa
ZWE            Zimbabwe            Harare    Africa

[234 rows x 3 columns]

In [42]:
df_world.head(3)

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [ ]:
df_world.iloc[9:14, 1:5]
df_world.loc['ARM':'AZE', 'Country':'2022 Population']

         Country     Capital      Continent  2022 Population
CCA3
ARM      Armenia     Yerevan           Asia        2805608.0
ABW        Aruba  Oranjestad  North America         106585.0
AUS    Australia    Canberra        Oceania       25670051.0
AUT      Austria      Vienna         Europe        8907777.0
AZE   Azerbaijan        Baku           Asia              NaN

In [59]:
m = df_world.loc[:, '2022 Population'] > 50e6
m_area = df_world.loc[:, 'Area (km²)'] > 500e3
df_world.loc[(m & m_area), ['Country', 'Capital']]

            Country           Capital
CCA3
BRA          Brazil          Brasilia
CHN           China           Beijing
COL        Colombia            Bogota
COD        DR Congo          Kinshasa
EGY           Egypt             Cairo
ETH        Ethiopia       Addis Ababa
FRA          France             Paris
IND           India         New Delhi
IDN       Indonesia           Jakarta
IRN            Iran            Tehran
KEN           Kenya           Nairobi
MEX          Mexico       Mexico City
MMR         Myanmar       Nay Pyi Taw
NGA         Nigeria             Abuja
PAK        Pakistan         Islamabad
RUS          Russia            Moscow
ZAF    South Africa          Pretoria
TZA        Tanzania            Dodoma
THA        Thailand           Bangkok
TUR          Turkey            Ankara
USA   United States  Washington, D.C.

In [68]:
df_world['2030 Population'] = df_world.loc[:, '2022 Population'] * 1.05
df_world.head(3)

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage,2030 Population
CCA3,,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,43185209.55
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2984437.05
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56,47148386.25

In [70]:
df_world.columns = ['Rank', 'Country', 'Capital', 'Continent', '2030 Population', '2022 Population',
       '2020 Population', '2015 Population', '2010 Population',
       '2000 Population', '1990 Population', '1980 Population',
       '1970 Population', 'Area (km²)', 'Density (per km²)', 'Growth Rate',
       'World Population Percentage']
df_world.head(3)

,Rank,Country,Capital,Continent,2030 Population,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,43185209.55
ALB,138,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2984437.05
DZA,34,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56,47148386.25

In [76]:
# df_world.drop('2030 Population', axis='columns', inplace=True)
# del df_world['2030 Population']
# df_world.pop('2030 Population')

In [72]:
df_world

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
AFG,36,Afghanistan,Kabul,Asia,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,43185209.55
ALB,138,Albania,Tirana,Europe,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2984437.05
DZA,34,Algeria,Algiers,Africa,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56,47148386.25
ASM,213,American Samoa,Pago Pago,Oceania,46189.0,51368.0,54849.0,58230.0,47818.0,32886.0,27075.0,199.0,222.4774,0.9831,0.00,46486.65
AND,203,Andorra,Andorra la Vella,Europe,77700.0,71746.0,71519.0,66097.0,53569.0,35611.0,19860.0,468.0,170.5641,1.0100,0.00,83815.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
WLF,226,Wallis and Futuna,Mata-Utu,Oceania,11655.0,12182.0,13142.0,14723.0,13454.0,11315.0,9377.0,142.0,81.4930,0.9953,0.00,12150.60
ESH,172,Western Sahara,El Aaiún,Africa,556048.0,491824.0,413296.0,270375.0,178529.0,116775.0,76371.0,266000.0,2.1654,1.0184,0.01,604785.30
YEM,46,Yemen,Sanaa,Asia,32284046.0,28516545.0,24743946.0,18628700.0,13375121.0,9204938.0,6843607.0,527968.0,63.8232,1.0217,0.42,35381444.70
ZMB,63,Zambia,Lusaka,Africa,18927715.0,NaN,13792086.0,9891136.0,7686401.0,5720438.0,4281671.0,752612.0,26.5976,1.0280,0.25,21018558.75
ZWE,74,Zimbabwe,Harare,Africa,15669666.0,14154937.0,12839771.0,11834676.0,10113893.0,7049926.0,5202918.0,390757.0,41.7665,1.0204,0.20,17136563.85

In [87]:
df_world.sort_index(inplace=True)
df_world.sort_values(['Continent', '2022 Population'], ascending=[True, False])

,Rank,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
CCA3,,,,,,,,,,,,,,,,
NGA,6,Nigeria,Abuja,Africa,208327405.0,183995785.0,160952853.0,122851984.0,95214257.0,72951439.0,55569264.0,923768.0,236.5759,1.0241,2.74,2.294683e+08
ETH,12,Ethiopia,Addis Ababa,Africa,117190911.0,102471895.0,89237791.0,67031867.0,47878073.0,34945469.0,28308246.0,1104300.0,111.7268,1.0257,1.55,1.295489e+08
EGY,14,Egypt,Cairo,Africa,107465134.0,97723799.0,87252413.0,71371371.0,57214630.0,43748556.0,34781986.0,1002450.0,110.7188,1.0158,1.39,1.165396e+08
COD,15,DR Congo,Kinshasa,Africa,92853164.0,78656904.0,66391257.0,48616317.0,35987541.0,26708686.0,20151733.0,2344858.0,42.2244,1.0325,1.24,1.039607e+08
TZA,22,Tanzania,Dodoma,Africa,61704518.0,52542823.0,45110527.0,34463704.0,26206012.0,19297659.0,13618192.0,945087.0,69.3034,1.0300,0.82,6.877264e+07
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
URY,133,Uruguay,Montevideo,South America,3429086.0,3402818.0,3352651.0,3292224.0,3117012.0,2953750.0,2790265.0,181034.0,18.9069,0.9990,0.04,3.593934e+06
GUY,164,Guyana,Georgetown,South America,797202.0,755031.0,747932.0,759051.0,747116.0,778176.0,705261.0,214969.0,3.7621,1.0052,0.01,8.491623e+05
SUR,170,Suriname,Paramaribo,South America,607065.0,575475.0,546080.0,478998.0,412756.0,375112.0,379918.0,163820.0,3.7727,1.0082,0.01,6.489420e+05
GUF,184,French Guiana,Cayenne,South America,290969.0,257026.0,228453.0,164351.0,113931.0,66825.0,46484.0,83534.0,3.6459,1.0239,0.00,3.197849e+05
FLK,231,Falkland Islands,Stanley,South America,3747.0,3408.0,3187.0,3080.0,2332.0,2240.0,2274.0,12173.0,0.3105,1.0043,0.00,3.969000e+03

In [91]:
df_pop = df_world.loc[:, '2022 Population':'2015 Population']
df_pop.head()

      2022 Population  2020 Population  2015 Population
CCA3
ABW          106585.0         104257.0         100341.0
AFG        38972230.0       33753499.0       28189672.0
AGO        33428485.0       28127721.0       23364185.0
AIA           15585.0          14525.0          13172.0
ALB         2866849.0        2882481.0        2913399.0

In [107]:
df_pop[df_pop['2022 Population'].isna()]

      2022 Population  2020 Population  2015 Population
CCA3
AZE               NaN        9863480.0        9237202.0

In [110]:
df_pop.isna()
# df_pop.isna().any(axis='rows')
df_pop[df_pop.isna().any(axis='columns')]

      2022 Population  2020 Population  2015 Population
CCA3
AZE               NaN        9863480.0        9237202.0
COL        50930662.0       47119728.0              NaN
GEO         3765912.0        3771132.0              NaN
GMB         2573995.0        2253133.0              NaN
GNQ         1596049.0              NaN        1094524.0
MDV          514438.0         435582.0              NaN
MOZ        31178239.0              NaN              NaN
MYS        33199993.0       31068833.0              NaN
NOR         5379839.0              NaN        4889741.0
SSD        10606227.0       11194299.0              NaN
ZMB        18927715.0              NaN       13792086.0

In [ ]:
ort = df_world['2022 Population'].mean()

df_world['2022 Population'].fillna(ort)

CCA3
AZE   NaN
Name: 2022 Population, dtype: float64

In [ ]:
df_world.drop_duplicates()

In [124]:
df_world['World Population Percentage'].astype('string')

CCA3
ABW             111767.25
AFG    43185209.550000004
AGO           37368436.35
AIA    16649.850000000002
ALB    2984437.0500000003
              ...
WSM              233501.1
YEM            35381444.7
ZAF           62888579.25
ZMB           21018558.75
ZWE           17136563.85
Name: World Population Percentage, Length: 234, dtype: string